/*
TOM共有5本新书，要借给A,B,C3位同学，每人只能借1本书，
则TOM可以有多少种不同的借书方法
*/
#include<stdio.h>
int main()
{
	int i,j,k;
	printf("There are different methods for TOM to distribute his book to A,B,C\n");
	for(i=1;i<=5;i++)
	  for(j=1;j<=5;j++)
	    for(k=1;k<=5;k++)
	      if(i!=j&&j!=k&&i!=k)
	        printf("(%d,%d,%d) ",i,j,k);
	return 0;
}
/*
There are different methods for TOM to distribute his book to A,B,C
(1,2,3) (1,2,4) (1,2,5) (1,3,2) (1,3,4) (1,3,5) (1,4,2) (1,4,3) (1,4,5) (1,5,2)
(1,5,3) (1,5,4) (2,1,3) (2,1,4) (2,1,5) (2,3,1) (2,3,4) (2,3,5) (2,4,1) (2,4,3)
(2,4,5) (2,5,1) (2,5,3) (2,5,4) (3,1,2) (3,1,4) (3,1,5) (3,2,1) (3,2,4) (3,2,5)
(3,4,1) (3,4,2) (3,4,5) (3,5,1) (3,5,2) (3,5,4) (4,1,2) (4,1,3) (4,1,5) (4,2,1)
(4,2,3) (4,2,5) (4,3,1) (4,3,2) (4,3,5) (4,5,1) (4,5,2) (4,5,3) (5,1,2) (5,1,3)
(5,1,4) (5,2,1) (5,2,3) (5,2,4) (5,3,1) (5,3,2) (5,3,4) (5,4,1) (5,4,2) (5,4,3)
*/ 
